-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- ホスト: localhost
-- 生成日時: 2023 年 5 月 29 日 17:37
-- サーバのバージョン： 10.4.28-MariaDB
-- PHP のバージョン: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `07_php02_work_items`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `items_table`
--

CREATE TABLE `items_table` (
  `id` int(11) NOT NULL,
  `item` varchar(100) NOT NULL,
  `photo_A` mediumblob NOT NULL,
  `photo_B` mediumblob NOT NULL,
  `photo_C` mediumblob NOT NULL,
  `explanation` varchar(100) NOT NULL,
  `created_at` datetime NOT NULL,
  `uploaded_at` datetime NOT NULL,
  `price` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

--
-- テーブルのデータのダンプ `items_table`
--

INSERT INTO `items_table` (`id`, `item`, `photo_A`, `photo_B`, `photo_C`, `explanation`, `created_at`, `uploaded_at`, `price`) VALUES
(5, 'Enzo GT EVO', 0x2e2f64617461486f6c6465722f656e7a6f677445564f30312e6a7067, 0x2e2f64617461486f6c6465722f656e7a6f677445564f30322e6a7067, 0x2e2f64617461486f6c6465722f656e7a6f677445564f30332e6a7067, 'エンツォフェラーリの実際には存在しないレーシングコンセプトモデル。当時のフェラーリF1のステッカーと同じ様なステッカーがボディに貼られています。', '2023-05-28 16:34:24', '2023-05-28 16:34:24', 38000),
(6, 'Enzo FERRARI', 0x2e2f64617461486f6c6465722f656e7a6f30312e6a7067, 0x2e2f64617461486f6c6465722f656e7a6f30322e6a7067, 0x2e2f64617461486f6c6465722f656e7a6f30332e6a7067, 'このエンツォ・フェラーリはミハエル・シューマッハがF1でワールドタイトルを取った時にフェラーリからプレゼントされた車です。', '2023-05-28 18:24:30', '2023-05-28 18:24:30', 15000),
(7, 'Enzo GT', 0x2e2f64617461486f6c6465722f656e7a6f677430312e6a7067, 0x2e2f64617461486f6c6465722f656e7a6f677430322e6a7067, 0x2e2f64617461486f6c6465722f656e7a6f677430332e6a7067, 'エンツォフェラーリのレーシングコンセプトモデル。実際には存在しない架空の仕様。', '2023-05-28 18:37:55', '2023-05-28 18:37:55', 40000),
(8, 'Porsche 911 GT1', 0x2e2f64617461486f6c6465722f3931315f30312e6a7067, 0x2e2f64617461486f6c6465722f3931315f30322e6a7067, 0x2e2f64617461486f6c6465722f3931315f30332e6a7067, '1997年のルマンに出場した車両。Makeupのモデルで細部まで丹精に作られています。', '2023-05-29 12:46:32', '2023-05-29 12:46:32', 40000),
(9, 'Audi R8 ', 0x2e2f64617461486f6c6465722f72385f30312e6a7067, 0x2e2f64617461486f6c6465722f72385f30322e6a7067, 0x2e2f64617461486f6c6465722f72385f30332e6a7067, '2000年のアデレード市街地コースで行われた耐久レースに参戦した車両です。ボディはフルラッピングでジャングルの生態系が描かれていて綺麗な一台です。市街地コースで走った数少ないR8です。', '2023-05-29 12:48:49', '2023-05-29 12:48:49', 5000),
(10, 'Bentley SPEED 8', 0x2e2f64617461486f6c6465722f494d475f343036322e6a7067, 0x2e2f64617461486f6c6465722f494d475f343036332e6a7067, 0x2e2f64617461486f6c6465722f494d475f343036342e6a7067, '2003年のルマンで総合優勝したベントレースピード8の7号車です。もう一台の8号車も走っていましたがリアウイングのサイドステーの形状が違いので見分けやすいです。', '2023-05-29 13:34:31', '2023-05-29 13:34:31', 6000),
(11, 'Mercedes C292', 0x2e2f64617461486f6c6465722f433239325f30312e6a7067, 0x2e2f64617461486f6c6465722f433239325f30322e6a7067, 0x2e2f64617461486f6c6465722f433239325f30332e6a7067, 'ザウバーメルセデスC291が活躍した翌年1992年にメルセデスがSWCに投入予定であったが、シリーズ不参加により幻になったマシン。ミニカーでのモデル化は珍しく貴重な車。', '2023-05-29 17:30:25', '2023-05-29 17:30:25', 25000),
(12, 'Mercedes C291', 0x2e2f64617461486f6c6465722f494d475f343031312e6a7067, 0x2e2f64617461486f6c6465722f494d475f343031322e6a7067, 0x2e2f64617461486f6c6465722f494d475f343031332e6a7067, 'このザウバーメルセデスC291は、1991年のSWCオートポリスラウンドでF1デビュー前のミハエル・シューマッハがドライブし優勝したマシン。フロント周りの造形美が特徴。', '2023-05-29 17:33:24', '2023-05-29 17:33:24', 15000),
(13, 'BMW M3 E92 DTM', 0x2e2f64617461486f6c6465722f6d335f64746d5f30312e6a7067, 0x2e2f64617461486f6c6465722f6d335f64746d5f30322e6a7067, 0x2e2f64617461486f6c6465722f6d335f64746d5f30332e6a7067, 'BMW M3 E92 DTMのボディーにニュルンベルクトイフェア限定販売のミニチャンプス社のチェッカーフラッグ柄を身に纏ったモデル。', '2023-05-29 17:35:55', '2023-05-29 17:35:55', 20000),
(14, 'BMW M3 E92', 0x2e2f64617461486f6c6465722f6d335f30312e6a7067, 0x2e2f64617461486f6c6465722f6d335f30322e6a7067, 0x2e2f64617461486f6c6465722f6d335f30332e6a7067, 'BMW M3 E92前期型。BMW特注の台座付き。ボンネットカウルが開閉可能でエンジンルーム内の再現を見ることができます。製造元はミニチャンプスです。', '2023-05-29 17:38:21', '2023-05-29 17:38:21', 12000),
(15, 'Shelby Cobra 427 S/C', 0x2e2f64617461486f6c6465722f313554486d6f64656c5f30312e6a7067, 0x2e2f64617461486f6c6465722f313554486d6f64656c5f30322e6a7067, 0x2e2f64617461486f6c6465722f313554486d6f64656c5f30332e6a7067, '京商が自社の１５周年を記念して発売されたブルークロムメッキが塗装されたシェルビーコブラです。ホコリがつくとクロムメッキに傷がつくので購入後未開封です。', '2023-05-29 17:42:26', '2023-05-29 17:42:26', 12000),
(16, 'CHEVROLET Corvette C5R', 0x2e2f64617461486f6c6465722f6335725f30312e6a7067, 0x2e2f64617461486f6c6465722f6335725f30322e6a7067, 0x2e2f64617461486f6c6465722f6335725f30332e6a7067, '2002年のルマンに出場した一台です。コルベットの特徴的なイエローが印象的な一台で、1/18サイズならではのフルギミック搭載のモデルです。', '2023-05-29 17:48:04', '2023-05-29 17:48:04', 35000);

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `items_table`
--
ALTER TABLE `items_table`
  ADD PRIMARY KEY (`id`);

--
-- ダンプしたテーブルの AUTO_INCREMENT
--

--
-- テーブルの AUTO_INCREMENT `items_table`
--
ALTER TABLE `items_table`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
